<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Jabra Direct and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.weber-st1.recipes.munki.JabraDirect</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Jabra Direct</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>DeactivateSystemExtension_1_1.app</string>
				<string>DeactivateSystemExtension_1_0.app</string>
				<string>Jabra Avaya3 Integration.app</string>
				<string>Jabra Bria Integration.app</string>
				<string>Jabra Direct Helper (Renderer).app</string>
				<string>Jabra Direct Helper (GPU).app</string>
				<string>Jabra Direct Helper.app</string>
				<string>Jabra Softphone Service.app</string>
				<string>Jabra Avaya Integration.app</string>
				<string>DeactivateSystemExtension_Beta.app</string>
				<string>Jabra Direct Helper (Plugin).app</string>
				<string>DeactivateSystemExtension_1_2.app</string>
				<string>Jabra Firmware Update.app</string>
				<string>Jabra Direct.app</string>
				<string>Jabra ZoomPluginMacOS.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Optimize and personalize your Jabra headset.</string>
			<key>developer</key>
			<string>GN Audio AS</string>
			<key>display_name</key>
			<string>Jabra Direct</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.weber-st1.recipes.download.JabraDirect</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
